### 第五章
#### 2、DataFrame

#### 将字典转换为dataframe

In [35]:
from pandas import Series,DataFrame
import pandas as pd

#### dataframe 中对应的每个数组需要等长
输出的frame数据的key的排序，可能会与创建的字典时的key的顺序不同，如下例

In [39]:
# 注意dataframe里面的字典的每个对象的数组长度必须等长
data={'state':['ok','error','finish'],
     'code':[1,2,3],
      'name':['a1','b2','c3']
     }
frame=DataFrame(data)
frame

   code name   state
0     1   a1      ok
1     2   b2   error
2     3   c3  finish

可以指定key的顺序

In [40]:
DataFrame(data,columns=['state','code','name'])

    state  code name
0      ok     1   a1
1   error     2   b2
2  finish     3   c3

传入的key在数据中找不到，会产生Na值

In [43]:
data=DataFrame(data,columns=['state','code','name','group'],index=['a','b','c'])
data

    state  code name group
a      ok     1   a1   NaN
b   error     2   b2   NaN
c  finish     3   c3   NaN

In [44]:
# 查看dataframe的所有列
data.columns

Index(['state', 'code', 'name', 'group'], dtype='object')

- 通过字典标记的方式   

- 通过属性的方式  

将dataframe的列获取为一个series

In [45]:
data['state']

a        ok
b     error
c    finish
Name: state, dtype: object

In [46]:
data.code

a    1
b    2
c    3
Name: code, dtype: int64

取出某一行使用
' ix '

In [51]:
data.ix['a']

state     ok
code       1
name      a1
group    NaN
Name: a, dtype: object

列通过赋值的方式进行修改

In [54]:
data.group="test"
data

    state  code name group
a      ok     1   a1  test
b   error     2   b2  test
c  finish     3   c3  test

也可以对空的group列赋上一个标量值或一组值

In [59]:
#data['group']=np.arange(2.)
np.arange(3.)

array([ 0.,  1.,  2.])

In [61]:
# 注意为dataframe的某一列赋值为一个数组时，数组的长度需要与列的长度（行数）相同
data['group']=np.arange(3.)
data

    state  code name  group
a      ok     1   a1    0.0
b   error     2   b2    1.0
c  finish     3   c3    2.0

当赋值为Series时，会精确匹配DataFrame的索引

In [63]:
val=Series([-1.2,-2],index=['a','b'])
data['group']=val
data

    state  code name  group
a      ok     1   a1   -1.2
b   error     2   b2   -2.0
c  finish     3   c3    NaN

为不存在的列赋值会创建出一个新的列

In [68]:
data['isok']=data.state=='ok'
data

    state  code name  group   isok
a      ok     1   a1   -1.2   True
b   error     2   b2   -2.0  False
c  finish     3   c3    NaN  False

In [69]:
# 不能删除不存在的列（或已经删除的列）
del data['isok']
data

    state  code name  group
a      ok     1   a1   -1.2
b   error     2   b2   -2.0
c  finish     3   c3    NaN

嵌套字典

In [72]:
pop={'nevada':{2001:2.4,2002:2.9},
    'ohio':{2000:1.5,2001:1.7,2002:3.6}}
data2=DataFrame(pop)
data2

      nevada  ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

设置DataFrame的index和columns的name属性

In [74]:
data2.index.name='year';data2.columns.name='state'
data2

state  nevada  ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [75]:
data2.columns

Index(['nevada', 'ohio'], dtype='object', name='state')

values属性会以二维ndarray的形式返回DataFrame中的数据

In [76]:
data2.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [78]:
data.values

array([['ok', 1, 'a1', -1.2],
       ['error', 2, 'b2', -2.0],
       ['finish', 3, 'c3', nan]], dtype=object)